app/controllers/total_closings_controller.rb

SELECT "total_closings".* FROM "total_closings"
---
  def index
    @total_closings = TotalClosing.all

INSERT INTO "total_closings" ("Bill_Received", "Bill_paid", "Cash_In_Hand", "Other_amount", "Other_paid", "Raj", "Sunny_Phone", "Sunny_Total", "TMZ_Phone", "TMZ_Total", "Total_creditcard", "Total_pin", "Total_sale", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @total_closing = TotalClosing.new(total_closing_params)

    respond_to do |format|
      if @total_closing.save

UPDATE "total_closings" SET "Total_sale" = ?, "Total_pin" = ?, "Total_creditcard" = ?, "TMZ_Phone" = ?, "TMZ_Total" = ?, "Sunny_Phone" = ?, "Sunny_Total" = ?, "Raj" = ?, "Bill_paid" = ?, "Bill_Received" = ?, "Other_paid" = ?, "Other_amount" = ?, "Cash_In_Hand" = ?, "updated_at" = ? WHERE "total_closings"."id" = 11
---
  def update
    respond_to do |format|
      if @total_closing.update(total_closing_params)

DELETE FROM "total_closings" WHERE "total_closings"."id" = ?  [["id", 4]]
---
  def destroy
    @total_closing.destroy

SELECT "total_closings".* FROM "total_closings" WHERE "total_closings"."id" = ? LIMIT 1  [["id", "11"]]
---
    def set_total_closing
      @total_closing = TotalClosing.find(params[:id])